In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from pandas import Series, DataFrame

In [5]:
score = Series(np.random.randint(1,101,5),index = list('ABCDE'))
score

A    93
B    15
C    50
D    26
E    86
dtype: int32

In [6]:
score1 = Series(np.random.randint(1,101,5),index = list('ABCDE'))
score2 = Series(np.random.randint(1,101,5),index = list('ABCDE'))
score3 = Series(np.random.randint(1,101,5),index = list('ABCDE'))

In [8]:
print(score1)
print(score2)
print(score3)

A    31
B    64
C    39
D    43
E    83
dtype: int32
A     17
B     73
C     24
D     18
E    100
dtype: int32
A    41
B    52
C    65
D    47
E    47
dtype: int32

In [10]:
arr1 = np.arange(1,126,5).reshape(5,5)
arr1

array([[  1,   6,  11,  16,  21],
       [ 26,  31,  36,  41,  46],
       [ 51,  56,  61,  66,  71],
       [ 76,  81,  86,  91,  96],
       [101, 106, 111, 116, 121]])

In [11]:
df = DataFrame(arr1)
df

     0    1    2    3    4
0    1    6   11   16   21
1   26   31   36   41   46
2   51   56   61   66   71
3   76   81   86   91   96
4  101  106  111  116  121

In [12]:
df1 = DataFrame(arr1, index=list('ABCDE'),columns = ['C1','C2','C3','C4','C5'])

In [13]:
df1

    C1   C2   C3   C4   C5
A    1    6   11   16   21
B   26   31   36   41   46
C   51   56   61   66   71
D   76   81   86   91   96
E  101  106  111  116  121

In [14]:
d2 = DataFrame({'C1':[1,2,3],'Names':['Aniket','Rahul','Mehul']})
d2

   C1   Names
0   1  Aniket
1   2   Rahul
2   3   Mehul

In [21]:
city = Series(['Mumbai','Pune','Mumbai'])
city

0    Mumbai
1      Pune
2    Mumbai
dtype: object

In [22]:
d2['City']= city

In [23]:
d2

   C1   Names    City
0   1  Aniket  Mumbai
1   2   Rahul    Pune
2   3   Mehul  Mumbai

In [24]:
Names = Series(['A','B','C'])
Names

0    A
1    B
2    C
dtype: object

In [25]:
Eng = Series([45,56,67])
Math = Series([98,100,87])
Sci = Series([78,89,67])

In [26]:
Eng

0    45
1    56
2    67
dtype: int64

In [27]:
Math

0     98
1    100
2     87
dtype: int64

In [28]:
Sci

0    78
1    89
2    67
dtype: int64

In [29]:
marks = DataFrame()

In [30]:
marks

Empty DataFrame
Columns: []
Index: []

In [31]:
marks['Names']= Names
marks['Eng']= Eng
marks['Math']= Math
marks['Science']= Sci

In [32]:
marks

  Names  Eng  Math  Science
0     A   45    98       78
1     B   56   100       89
2     C   67    87       67

In [36]:
m1 = marks.sort_values(by = 'Math')

In [37]:
m1

  Names  Eng  Math  Science
2     C   67    87       67
0     A   45    98       78
1     B   56   100       89

In [38]:
m1.sort_index()

  Names  Eng  Math  Science
0     A   45    98       78
1     B   56   100       89
2     C   67    87       67

In [39]:
m1.ix()

C:\Anac\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [40]:
m1.iloc()

In [42]:
m1.iloc[1,3]

78

m1.loc[1,3]

In [43]:
m1.iloc[1:]= np.nan

In [44]:
m1

  Names   Eng  Math  Science
2     C  67.0  87.0     67.0
0   NaN   NaN   NaN      NaN
1   NaN   NaN   NaN      NaN

In [45]:
m1.dropna()

  Names   Eng  Math  Science
2     C  67.0  87.0     67.0

In [46]:
m1

  Names   Eng  Math  Science
2     C  67.0  87.0     67.0
0   NaN   NaN   NaN      NaN
1   NaN   NaN   NaN      NaN

In [47]:
marks

  Names  Eng  Math  Science
0     A   45    98       78
1     B   56   100       89
2     C   67    87       67

In [50]:
m2 = marks

In [51]:
m2

  Names   Eng   Math  Science
0     A  45.0   98.0     78.0
1     B  56.0  100.0     89.0
2     C  67.0   87.0     67.0

In [52]:

m2.iloc[0:2]=np.nan

In [53]:
m2

  Names   Eng  Math  Science
0   NaN   NaN   NaN      NaN
1   NaN   NaN   NaN      NaN
2     C  67.0  87.0     67.0

In [54]:
m2.dropna()

  Names   Eng  Math  Science
2     C  67.0  87.0     67.0

In [55]:
m2

  Names   Eng  Math  Science
0   NaN   NaN   NaN      NaN
1   NaN   NaN   NaN      NaN
2     C  67.0  87.0     67.0

In [56]:
m3 = m1

In [57]:
m3

  Names   Eng  Math  Science
2     C  67.0  87.0     67.0
0   NaN   NaN   NaN      NaN
1   NaN   NaN   NaN      NaN

In [58]:
m3.iloc[2:]

  Names  Eng  Math  Science
1   NaN  NaN   NaN      NaN

In [60]:
m3.loc[2:]

  Names   Eng  Math  Science
2     C  67.0  87.0     67.0
0   NaN   NaN   NaN      NaN
1   NaN   NaN   NaN      NaN

In [62]:
import seaborn as sns
d1 = sns.load_dataset('tips')

In [64]:
d1.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [65]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.2 KB